ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153cxx_cm4.h
/***************  Bit definition for DDRPHYC_DDR3_MR2 register  ***************/
#define DDRPHYC_DDR3_MR2_PASR_Pos  (0U)
#define DDRPHYC_DDR3_MR2_PASR_Msk  (0x7U << DDRPHYC_DDR3_MR2_PASR_Pos)  /*!< 0x00000007 */
#define DDRPHYC_DDR3_MR2_PASR      DDRPHYC_DDR3_MR2_PASR_Msk            /*!< Partial array self-refresh */
#define DDRPHYC_DDR3_MR2_PASR_0    (0x1U << DDRPHYC_DDR3_MR2_PASR_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR2_PASR_1    (0x2U << DDRPHYC_DDR3_MR2_PASR_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR2_PASR_2    (0x4U << DDRPHYC_DDR3_MR2_PASR_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR2_CWL_Pos   (3U)
#define DDRPHYC_DDR3_MR2_CWL_Msk   (0x7U << DDRPHYC_DDR3_MR2_CWL_Pos)   /*!< 0x00000038 */
#define DDRPHYC_DDR3_MR2_CWL       DDRPHYC_DDR3_MR2_CWL_Msk             /*!< CAS write latency */
#define DDRPHYC_DDR3_MR2_CWL_0     (0x1U << DDRPHYC_DDR3_MR2_CWL_Pos)   /*!< 0x00000008 */
#define DDRPHYC_DDR3_MR2_CWL_1     (0x2U << DDRPHYC_DDR3_MR2_CWL_Pos)   /*!< 0x00000010 */
#define DDRPHYC_DDR3_MR2_CWL_2     (0x4U << DDRPHYC_DDR3_MR2_CWL_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DDR3_MR2_ASR_Pos   (6U)
#define DDRPHYC_DDR3_MR2_ASR_Msk   (0x1U << DDRPHYC_DDR3_MR2_ASR_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DDR3_MR2_ASR       DDRPHYC_DDR3_MR2_ASR_Msk             /*!< Auto self-refresh */
#define DDRPHYC_DDR3_MR2_SRT_Pos   (7U)
#define DDRPHYC_DDR3_MR2_SRT_Msk   (0x1U << DDRPHYC_DDR3_MR2_SRT_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DDR3_MR2_SRT       DDRPHYC_DDR3_MR2_SRT_Msk             /*!< Self-refresh temperature range */
#define DDRPHYC_DDR3_MR2_RTTWR_Pos (9U)
#define DDRPHYC_DDR3_MR2_RTTWR_Msk (0x3U << DDRPHYC_DDR3_MR2_RTTWR_Pos) /*!< 0x00000600 */
#define DDRPHYC_DDR3_MR2_RTTWR     DDRPHYC_DDR3_MR2_RTTWR_Msk           /*!< Dynamic ODT */
#define DDRPHYC_DDR3_MR2_RTTWR_0   (0x1U << DDRPHYC_DDR3_MR2_RTTWR_Pos) /*!< 0x00000200 */
#define DDRPHYC_DDR3_MR2_RTTWR_1   (0x2U << DDRPHYC_DDR3_MR2_RTTWR_Pos) /*!< 0x00000400 */
#define DDRPHYC_DDR3_MR2_RLWL_Pos  (0U)
#define DDRPHYC_DDR3_MR2_RLWL_Msk  (0x7U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000007 */
#define DDRPHYC_DDR3_MR2_RLWL      DDRPHYC_DDR3_MR2_RLWL_Msk            /*!< Read and write latency */
#define DDRPHYC_DDR3_MR2_RLWL_0    (0x1U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR2_RLWL_1    (0x2U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR2_RLWL_2    (0x4U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR2_RLWL_Pos  (0U)
#define DDRPHYC_DDR3_MR2_RLWL_Msk  (0x7U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000007 */
#define DDRPHYC_DDR3_MR2_RLWL      DDRPHYC_DDR3_MR2_RLWL_Msk            /*!< Read and write latency */
#define DDRPHYC_DDR3_MR2_RLWL_0    (0x1U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR2_RLWL_1    (0x2U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR2_RLWL_2    (0x4U << DDRPHYC_DDR3_MR2_RLWL_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR2_NWRE_Pos  (4U)
#define DDRPHYC_DDR3_MR2_NWRE_Msk  (0x1U << DDRPHYC_DDR3_MR2_NWRE_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DDR3_MR2_NWRE      DDRPHYC_DDR3_MR2_NWRE_Msk            /*!< New for LPDDR3 (not used by this PHY, leave at zero) */
#define DDRPHYC_DDR3_MR2_WL_Pos    (6U)
#define DDRPHYC_DDR3_MR2_WL_Msk    (0x1U << DDRPHYC_DDR3_MR2_WL_Pos)    /*!< 0x00000040 */
#define DDRPHYC_DDR3_MR2_WL        DDRPHYC_DDR3_MR2_WL_Msk              /*!< New for LPDDR3 (not used by this PHY, leave at zero) */
#define DDRPHYC_DDR3_MR2_WR_Pos    (7U)
#define DDRPHYC_DDR3_MR2_WR_Msk    (0x1U << DDRPHYC_DDR3_MR2_WR_Pos)    /*!< 0x00000080 */
#define DDRPHYC_DDR3_MR2_WR        DDRPHYC_DDR3_MR2_WR_Msk              /*!< New for LPDDR3 (not used by this PHY, leave at zero) */

/***************  Bit definition for DDRPHYC_DDR3_MR3 register  ***************/
#define DDRPHYC_DDR3_MR3_MPRLOC_Pos (0U)
#define DDRPHYC_DDR3_MR3_MPRLOC_Msk (0x3U << DDRPHYC_DDR3_MR3_MPRLOC_Pos) /*!< 0x00000003 */
#define DDRPHYC_DDR3_MR3_MPRLOC     DDRPHYC_DDR3_MR3_MPRLOC_Msk           /*!< Multi-purpose register (MPR) location */
#define DDRPHYC_DDR3_MR3_MPRLOC_0   (0x1U << DDRPHYC_DDR3_MR3_MPRLOC_Pos) /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR3_MPRLOC_1   (0x2U << DDRPHYC_DDR3_MR3_MPRLOC_Pos) /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR3_MPR_Pos    (2U)
#define DDRPHYC_DDR3_MR3_MPR_Msk    (0x1U << DDRPHYC_DDR3_MR3_MPR_Pos)    /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR3_MPR        DDRPHYC_DDR3_MR3_MPR_Msk              /*!< Multi-purpose register enable */

/****************  Bit definition for DDRPHYC_ODTCR register  *****************/
#define DDRPHYC_ODTCR_RDODT_Pos (0U)
#define DDRPHYC_ODTCR_RDODT_Msk (0x1U << DDRPHYC_ODTCR_RDODT_Pos) /*!< 0x00000001 */
#define DDRPHYC_ODTCR_RDODT     DDRPHYC_ODTCR_RDODT_Msk           /*!< Specifies whether ODT should be enabled ('1') or disabled ('0') on read */
#define DDRPHYC_ODTCR_WRODT_Pos (16U)
#define DDRPHYC_ODTCR_WRODT_Msk (0x1U << DDRPHYC_ODTCR_WRODT_Pos) /*!< 0x00010000 */
#define DDRPHYC_ODTCR_WRODT     DDRPHYC_ODTCR_WRODT_Msk           /*!< Specifies whether ODT should be enabled ('1') or disabled ('0') on write */

/*****************  Bit definition for DDRPHYC_DTAR register  *****************/
#define DDRPHYC_DTAR_DTCOL_Pos  (0U)
#define DDRPHYC_DTAR_DTCOL_Msk  (0xFFFU << DDRPHYC_DTAR_DTCOL_Pos)  /*!< 0x00000FFF */
#define DDRPHYC_DTAR_DTCOL      DDRPHYC_DTAR_DTCOL_Msk              /*!< Data training column address: */
#define DDRPHYC_DTAR_DTCOL_0    (0x1U << DDRPHYC_DTAR_DTCOL_Pos)    /*!< 0x00000001 */
#define DDRPHYC_DTAR_DTCOL_1    (0x2U << DDRPHYC_DTAR_DTCOL_Pos)    /*!< 0x00000002 */
#define DDRPHYC_DTAR_DTCOL_2    (0x4U << DDRPHYC_DTAR_DTCOL_Pos)    /*!< 0x00000004 */
#define DDRPHYC_DTAR_DTCOL_3    (0x8U << DDRPHYC_DTAR_DTCOL_Pos)    /*!< 0x00000008 */
#define DDRPHYC_DTAR_DTCOL_4    (0x10U << DDRPHYC_DTAR_DTCOL_Pos)   /*!< 0x00000010 */
#define DDRPHYC_DTAR_DTCOL_5    (0x20U << DDRPHYC_DTAR_DTCOL_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DTAR_DTCOL_6    (0x40U << DDRPHYC_DTAR_DTCOL_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DTAR_DTCOL_7    (0x80U << DDRPHYC_DTAR_DTCOL_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DTAR_DTCOL_8    (0x100U << DDRPHYC_DTAR_DTCOL_Pos)  /*!< 0x00000100 */
#define DDRPHYC_DTAR_DTCOL_9    (0x200U << DDRPHYC_DTAR_DTCOL_Pos)  /*!< 0x00000200 */
#define DDRPHYC_DTAR_DTCOL_10   (0x400U << DDRPHYC_DTAR_DTCOL_Pos)  /*!< 0x00000400 */
#define DDRPHYC_DTAR_DTCOL_11   (0x800U << DDRPHYC_DTAR_DTCOL_Pos)  /*!< 0x00000800 */
#define DDRPHYC_DTAR_DTROW_Pos  (12U)
#define DDRPHYC_DTAR_DTROW_Msk  (0xFFFFU << DDRPHYC_DTAR_DTROW_Pos) /*!< 0x0FFFF000 */
#define DDRPHYC_DTAR_DTROW      DDRPHYC_DTAR_DTROW_Msk              /*!< Data training row address: */
#define DDRPHYC_DTAR_DTROW_0    (0x1U << DDRPHYC_DTAR_DTROW_Pos)    /*!< 0x00001000 */
#define DDRPHYC_DTAR_DTROW_1    (0x2U << DDRPHYC_DTAR_DTROW_Pos)    /*!< 0x00002000 */
#define DDRPHYC_DTAR_DTROW_2    (0x4U << DDRPHYC_DTAR_DTROW_Pos)    /*!< 0x00004000 */
#define DDRPHYC_DTAR_DTROW_3    (0x8U << DDRPHYC_DTAR_DTROW_Pos)    /*!< 0x00008000 */
#define DDRPHYC_DTAR_DTROW_4    (0x10U << DDRPHYC_DTAR_DTROW_Pos)   /*!< 0x00010000 */
#define DDRPHYC_DTAR_DTROW_5    (0x20U << DDRPHYC_DTAR_DTROW_Pos)   /*!< 0x00020000 */
#define DDRPHYC_DTAR_DTROW_6    (0x40U << DDRPHYC_DTAR_DTROW_Pos)   /*!< 0x00040000 */
#define DDRPHYC_DTAR_DTROW_7    (0x80U << DDRPHYC_DTAR_DTROW_Pos)   /*!< 0x00080000 */
#define DDRPHYC_DTAR_DTROW_8    (0x100U << DDRPHYC_DTAR_DTROW_Pos)  /*!< 0x00100000 */
#define DDRPHYC_DTAR_DTROW_9    (0x200U << DDRPHYC_DTAR_DTROW_Pos)  /*!< 0x00200000 */
#define DDRPHYC_DTAR_DTROW_10   (0x400U << DDRPHYC_DTAR_DTROW_Pos)  /*!< 0x00400000 */
#define DDRPHYC_DTAR_DTROW_11   (0x800U << DDRPHYC_DTAR_DTROW_Pos)  /*!< 0x00800000 */
#define DDRPHYC_DTAR_DTROW_12   (0x1000U << DDRPHYC_DTAR_DTROW_Pos) /*!< 0x01000000 */
#define DDRPHYC_DTAR_DTROW_13   (0x2000U << DDRPHYC_DTAR_DTROW_Pos) /*!< 0x02000000 */
#define DDRPHYC_DTAR_DTROW_14   (0x4000U << DDRPHYC_DTAR_DTROW_Pos) /*!< 0x04000000 */
#define DDRPHYC_DTAR_DTROW_15   (0x8000U << DDRPHYC_DTAR_DTROW_Pos) /*!< 0x08000000 */
#define DDRPHYC_DTAR_DTBANK_Pos (28U)
#define DDRPHYC_DTAR_DTBANK_Msk (0x7U << DDRPHYC_DTAR_DTBANK_Pos)   /*!< 0x70000000 */
#define DDRPHYC_DTAR_DTBANK     DDRPHYC_DTAR_DTBANK_Msk             /*!< Data training bank address: */
#define DDRPHYC_DTAR_DTBANK_0   (0x1U << DDRPHYC_DTAR_DTBANK_Pos)   /*!< 0x10000000 */
#define DDRPHYC_DTAR_DTBANK_1   (0x2U << DDRPHYC_DTAR_DTBANK_Pos)   /*!< 0x20000000 */
#define DDRPHYC_DTAR_DTBANK_2   (0x4U << DDRPHYC_DTAR_DTBANK_Pos)   /*!< 0x40000000 */
#define DDRPHYC_DTAR_DTMPR_Pos  (31U)
#define DDRPHYC_DTAR_DTMPR_Msk  (0x1U << DDRPHYC_DTAR_DTMPR_Pos)    /*!< 0x80000000 */
#define DDRPHYC_DTAR_DTMPR      DDRPHYC_DTAR_DTMPR_Msk              /*!< Data training using MPR (DDR3 Only): */

